finance-express/tests/artillery/scenarios/channel-set.scenarios.yaml
config:
  phases:
    - duration: 10
      arrivalRate: 1

scenarios:
  - name: "ChannelSet"
    flow:
      - function: "defineVariables"
      - log: "Login"
      - function: "auth"
      - log: "accessToken: {{accessToken}}"
      - function: "enableBusiness"

      - log: "GET /api/business/{{businessId}}/channel-set/{{channelSetId}}"
      - get:
          url: "/api/business/{{businessId}}/channel-set/{{channelSetId}}"
          headers:
            authorization: "Bearer {{accessToken}}"

      - log: "GET /api/business/{{businessId}}/channel-set/type/{{channelType}}"
      - get:
          url: "/api/business/{{businessId}}/channel-set/type/{{channelType}}"
          headers:
            authorization: "Bearer {{accessToken}}"

      - log: "POST /api/business/{{businessId}}/channel-set/type/{{channelType}}"
      - post:
          url: "/api/business/{{businessId}}/channel-set/type/{{channelType}}"
          headers:
            authorization: "Bearer {{accessToken}}"
          afterResponse: "defineChannelSetId"

      - log: "DELETE /api/business/{{businessId}}/channel-set/{{channelSetId}}"
      - delete:
          url: "/api/business/{{businessId}}/channel-set/{{channelSetId}}"
          headers:
            authorization: "Bearer {{accessToken}}"